# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'koekeishiya/formulae'

# Binaries
brew 'bat'
brew 'bash'
brew 'curl'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'htop'
brew 'neovim', args: ['HEAD']
brew 'nvm'
brew 'skhd'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'yabai'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Applications
cask 'bitwarden'
cask 'docker'
cask 'font-fira-code'
cask 'iterm2'
cask 'logitech-options'
cask 'messenger'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'
