# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Binaries
brew 'curl'
brew 'git'
brew 'mas'
brew 'node'
brew 'nvm'
brew 'tree'
brew 'wget'
brew 'zsh'

# Applications
cask 'bitwarden'
cask 'docker'
cask 'font-fira-code'
cask 'iterm2'
cask 'logitech-options'
cask 'messenger'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'

# Mac App Store
mas 'Magnet', id: 441258766
