# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Binaries
brew 'bat'
brew 'bash'
brew 'curl'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'htop'
brew 'mas'
brew 'neovim', args: ['HEAD']
brew 'nvm'
brew 'rg'
brew 'stow'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'

# Applications
# TODO: https://github.com/ianyh/Amethyst/issues/979
cask 'amethyst'
cask 'bitwarden'
cask 'docker'
cask 'font-fira-code'
cask 'iterm2'
cask 'logitech-options'
cask 'messenger'
cask 'monitorcontrol'
cask 'scroll-reverser'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'

# Mac App Store
mas 'Ethernet Status', id: '1186187538'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge'
